{
    "intro_1": "Hej, jag är ",
    "intro_2": "Liam Andersson",
    "intro_3": "En datavetenskapsstudent med en passion för att lära och skapa.",
    "contact_me": "Mejla mig!",
    "about_1": "Jag studerar för närvarande en masterexamen i datavetenskap vid Linköpings universitet, där jag började mina studier 2021. ¨Jag kommer ursprungligen från den charmiga kuststaden Kalmar i Småland, Sverige, men flyttade till Linköping efter att jag tog studenten 2021. \n Det var under mina gymnasieår i Kalmar som jag insåg min passion för datavetenskap. Min resa in i programmering började med spel – specifikt Minecraft – vilket väckte mitt intresse för att skapa applikationer och förstå teknologin bakom dem. \n Som en drivande och nyfiken student söker jag ständigt efter att utöka mina kunskaper inom datavetenskapens område. Jag är alltid öppen för att lära mig nya ramverk, verktyg och programmeringsspråk och omfamnar möjligheter som hjälper mig att växa som utvecklare och problemlösare.",
    "about_2": "Utanför mina studier tycker jag om att ägna mig åt hobbies som ger mig både avslappning och spänning. Fiske är ett stort intresse under sommaren, särskilt för lugnet det ger att vara ute i naturen kombinerat med spänningen i ögonblicket när en fisk nappar. Hittills har jag bara fiskat under sena våren och sommaren, men jag hoppas att kunna utöka denna hobby till andra årstider i framtiden. \n Under 2024 började jag också min resa mot att ta motorcykelkörkort – en utmaning som visade sig vara otroligt rolig. Mitt mål är att ta körkortet sommaren 2025, och jag ser fram emot de äventyr som detta nya kapitel kommer att föra med sig. Just nu kör jag en Kawasaki Ninja 650, som har varit en fantastisk motorcykel att lära sig på. \n Jag tycker också om att arbeta med personliga projekt utanför skolan. Även om några av dessa projekt tenderar att vara lite ambitiösa och inte alltid blir färdiga på grund av tidsbegränsningar, är de ett bra sätt för mig att utforska nya idéer och lära mig under resans gång.",
    "name": "Namn",
    "email": "E-post",
    "message": "Meddelande",
    "send": "Skicka",
    "sending": "Skickar...",
    "fail_mail": "Misslyckades att skicka mejlet!",
    "success_mail": "Mejlet skickades framgångsrikt!",
    "introduction": "Introduktion",
    "contact": "Kontakt",
    "projects": "Projekt",
    "experience": "Erfarenhet",
    "resume": "Visa fullständigt CV",
    "about": "Om mig",
    "project_info": "Följande projekt hämtas direkt från GitHub och informationen är därför endast tillgänglig på engelska.",
    "copy_right": "© 2025 Liam Andersson. Alla rättigheter förbehållna.",
    "experiences": {
        "amanues_jan_2025": {
            "role": "Amanuens",
            "startDate": "Jan 2025",
            "endDate": "Nu",
            "company": "Linköpings Universitet",
            "description": "Handledare i en kurs, TDDD80. Den här kursen hanterar utveckling av en backend i Python med Flask samt en frontend för Android/iOS i Flutter med Dart.",
            "tags": ["Flutter", "Flask", "Microsoft Azure", "Python", "Dart"],
            "link": "https://liu.se"
        },
        "amanues_aug_2024": {
            "role": "Amanuens",
            "startDate": "Aug 2024",
            "endDate": "Dec 2024",
            "company": "Linköpings Universitet",
            "description": "Amanuens på Linköpings Universitet under höstterminen. Jag var handledare i kurserna TDP028, TDDE43 och TDDC73. Alla dessa kurser hanterade app-utveckling i Flutter. TDDC73 hanterade också React Native, Jetpack Compose och vanlig XML.",
            "tags": ["Flutter", "React Native", "Jetpack Compose", "XML", "Firebase"],
            "link": "https://liu.se"
        },
        "programmer_aug_2024": {
            "role": "Programmerare",
            "startDate": "Juni 2024",
            "endDate": "Aug 2024",
            "company": "Mindroad",
            "description": "Arbetade som programmerare på Mindroad där jag utvecklade en kurs inom React Native och skapade projekt för kursen med React Native och TypeScript. Utöver detta arbetade jag med utveckling av en hemsida med HTML, CSS, JavaScript och en relationsdatabas i SQL.",
            "tags": ["React Native", "TypeScript", "HTML", "CSS", "JavaScript", "SQL"],
            "link": "https://www.mindroad.se/sv-SE"
        },
        "amanues_jan_2024": {
            "role": "Amanuens",
            "startDate": "Jan 2024",
            "endDate": "Maj 2024",
            "company": "Linköpings Universitet",
            "description": "Handledare i en kurs, TDDD80. Den här kursen hanterar utveckling av en backend i Python med Flask samt en frontend för Android i Java/Kotlin och XML.",
            "tags": ["Python", "Flask", "Java", "Kotlin", "XML"],
            "link": "https://liu.se"
        },
        "amanues_aug_2023": {
            "role": "Amanuens",
            "startDate": "Aug 2023",
            "endDate": "Dec 2023",
            "company": "Linköpings Universitet",
            "description": "Handledare i två kurser, TDP028 och TDDE43. Båda dessa kurser hanterade utveckling av appar till Android i Java/Kotlin och XML.",
            "tags": ["Java", "Kotlin", "XML", "Firebase", "Microsoft Azure", "Python"],
            "link": "https://liu.se"
        },
        "maintenance_technician_2023": {
            "role": "Underhållstekniker",
            "startDate": "Juni 2023",
            "endDate": "Aug 2023",
            "company": "Arla, Linköping",
            "description": "Sommarjobb på Arla. Jobbade med att lösa diverse problem med maskiner.",
            "tags": ["Maskinunderhåll"],
            "link": "https://www.arla.com/company/job-and-career/"
        }
    },
    "projects_github": [
        {
            "name": "Spelmotor",
            "description": "En spelmotor utvecklad i C++ med OpenGL. Motorn fokuserar på 3D och har för närvarande ingen stöd för 2D.",
            "languages": ["C++", "OpenGL", "GLSL", "CMake"],
            "link": "https://github.com/Dubstepzedd/GameEngine"
        },
        {
            "name": "Flappy Bird-klon",
            "description": "Mitt första projekt i C++. Projektet är en klon av spelet Flappy Bird som använder SDL-biblioteket.",
            "languages": ["C++"],
            "link": "https://github.com/Dubstepzedd/FlappyBirdClone"
        },
        {
            "name": "Examenswebbplats",
            "description": "En webbplats utvecklad i PHP, CSS, HTML och lite Javascript. Webbplatsen innehåller ett inloggningssystem, önskelista, e-postsystem, adminpanel och mer.",
            "languages": ["PHP", "CSS", "HTML", "JavaScript", "SQL"],
            "link": "https://github.com/Dubstepzedd/Graduation-Website"
        },
        {
            "name": "Portföljwebbplats",
            "description": "Detta är sidan du är på just nu. Webbplatsen är utvecklad i React med TypeScript, TailwindCSS och i18next.",
            "languages": ["TypeScript", "React", "TailwindCSS", "i18next"],
            "link": "https://github.com/Dubstepzedd/Portfolio"
        },
        {
            "name": "Android-app",
            "description": "En app som liknar Strava, men med mycket färre funktioner. Appen är utvecklad i Java och XML med Android Studio. Projektet har en egen backend utvecklad i Python med Flask.",
            "languages": ["Java", "XML", "Python", "Flask", "SQL"],
            "link": "https://github.com/Dubstepzedd/Android-Project"
        }
    ]

}
